# GetFormatOptions Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Units..::..GetFormatOptions Method
Units Class See Also
---
Gets the default FormatOptions for a spec.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public FormatOptions GetFormatOptions(
	ForgeTypeId specTypeId
)
```

Visual Basic
---
```text
Public Function GetFormatOptions ( _
	specTypeId As ForgeTypeId _
) As FormatOptions
```

Visual C++
---
```text
public:
FormatOptions^ GetFormatOptions(
	ForgeTypeId^ specTypeId
)
```

# ### Parameters
specTypeId
    Type: Autodesk.Revit.DB..::..ForgeTypeId Identifier of the spec.
# ### Return Value
A copy of the FormatOptions.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | specTypeId is not a measurable spec identifier. See UnitUtils.IsMeasurableSpec(ForgeTypeId). |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
Units Class
Autodesk.Revit.DB Namespace